Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/after_your_baby_is_born/supports_for_postnatal_depression.html.txt.tmx
Source language: en
Languages: ga

source: Supports for postnatal depression
ga: Tacaíochtaí do dhúlagar iarbhreithe

source: Many women suffer "the baby blues" during the first weeks after childbirth
ga: Fulaingíonn go leor ban ísliú meanmna sa chéad cúpla seachtain tar éis breith linbh

source: Giving birth can be a highly emotional and physically traumatic experience and the sudden drop in hormone levels following birth can leave you emotionally and physically drained
ga: Eachtra chorraitheach agus fíor fhisiciúil é leanbh a thabhairt ar an saol agus de bharr titim i leibhéal na hormón tar éis na breithe is minic go mothaíonn mná traochta go fisiciúil agus ó thaobh a mothucháin

source: You may feel weepy, hyper-sensitive, anxious and alone in the world
ga: Is féidir leo a bheith caointeach, hipearmhothaíoch, faoi dá mbeidís fágtha ina n-aonar sa saol

source: About 80% of women feel like this and will experience "the baby blues" at some point following the birth of their baby
ga: Tuairim is 80% de mhná a mbíonn páistí acu a fhulaingíonn mar seo agus beidh ísliú meanmna orthu ag am éigean tar éis breith a linbh

source: These feelings will usually pass, with some rest and physical and moral support from your partner, family and friends
ga: Go hiondúil tagann mná chucu féin le beagán scíthe agus le tacaíocht fisiciúil agus spride óna bpáirtithe, óna dteaghlaigh agus ó chairde

source: However, you may be one of the 10% of women who go on to develop postnatal depression
ga: Áfach d'fhéadfadh sé go bhfuil sí i measc an 10% de mhná a fhulaingíonn ón dúlagar iarbhreithe

source: Postnatal depression usually begins 2 to 8 weeks following birth, but can sometimes appear up to 6 months or even a year after birth
ga: Tosnaíonn an dúlagar iarbhreithe go hiondúil idir 2 agus 8 seachtain tar éis na breithe, ach anois is arís tagann sé chun solais 6 mhí nó bliain fiú tar éis na breithe

source: Unfortunately, many women experience this form of depression without even being aware of the symptoms or the fact that postnatal depression is a real illness
ga: Sa drochuair, bíonn an dúlagar seo ar go leor ban i ngan fhios dóibh féin nó gan tuiscint a bheith acu gur fíorghalar atá sa dúlagar iarbhreithe

source: They experience some of the following feeling:
ga: Tá aon cheann de na mothucháin seo acu:

source: • Feeling that you can't cope with your baby
ga: • Mothú nach féidir leat déileáil le do leanbh

source: • Exhausted but unable to sleep
ga: • Traochta ach nach bhfuil ar do chumas codladh a dhéanamh

source: • Excessive anxiety about your baby
ga: • An iomarca imní faoi do leanbh

source: If you are experiencing some of these feelings, you may be suffering from postnatal depression and you should ask for help
ga: Má tá aon cheann de na mothucháin seo agat, b'fhéidir go bhfuil tú ag fulaingt ó dhúlagar iarbhreithe agus ba cheart duit cúnamh a iarraidh

source: Talk to your family doctor (GP) or public health nurse or someone you can trust
ga: Labhair leis an dochtúir teaghlaigh nó le haltra sláinte poiblí nó le duine gur féidir leat muinín a bheith agat aisti/ann

source: If you don't feel up to making an appointment to see your GP or public health nurse, ask someone to do this for you or arrange for a home visit
ga: Muna bhfuil tú féin in ann coinne a dhéanamh leis an dochtúir nó leis an altra sláinte poiblí iarr ar duine eile é seo a dhéanamh ar do shon nó iarr ar an dochtúir/altra teacht chuig do theach

source: Healthcare professionals have experience with this type of depression - they will listen to you, and will be able to discuss available options with you
ga: Tá cur amach ag gairmithe cúram sláinte ar an saghas seo dúlagair – éistfidh siad leat, agus beidh siad in ann plé a dhéanamh leat ar na roghanna atá ar fáil

source: Postnatal depression can happen to any woman and can occur at any time after your baby is born - treatment is very successful, so it is important to recognise the symptoms and seek help
ga: Féadfaidh dúlagar iarbhreithe teacht ar aon bhean agus féadfaidh sé tarlú ag aon tráth i ndiaidh go saolaítear do leanbh – bíonn an chóireáil an-rathúil, mar sin, is tábhachtach na siomptóim a aithint agus cabhair a lorg

source: If you have had your baby recently, the maternity hospital may be able to help
ga: Má bhí an páiste agat le deireanas b'fhéidir go mbeadh cúnamh ar fáil duit ón ospidéal máthaireachais

source: Contact the midwife or doctor who cared for you during your pregnancy
ga: Déan teagmháil leis an mbean chabhartha nó leis an dochtúir a thug aire duit agus tú ag súil leis an bpáiste

source: It is possible you may be referred to the hospital psychiatrist, who will discuss your depression with you and will look at available supports
ga: D'fhéadfadh sé go mbeadh coinne déanta duit le síciatraí an ospidéil, labharfaidh sé/sí leat faoin dúlagar atá ort agus inseoidh sé/sí duit faoin tacaíocht atá ar fáil duit

source: The hospital social work department will also be able to help
ga: Beidh cúnamh ar fáil duit freisin ón rannóg oibre sóisialta atá ag an ospidéal

source: Advice for family and friends
ga: Comhairle do theaghlaigh agus do chairde

source: If your partner, family member or someone you know is suffering from postnatal depression, it is important to recognise the symptoms and remember that this illness is very real but also very treatable
ga: Má tá do pháirtí, duine den teaghlach nó bean ar d'aithne ag fulaingt ón dúlagar iarbhreithe tá sé tábhachtach na comharthaí a bhaineann leis a aithint agus a chuimnhiú gur galar atá ann gur féidir cúnamh a chur ar fáil lena aghaidh

source: As a friend or family member, you will need to provide lots of support and help - as with all illnesses, recovery may be slow and there will be good and bad days
ga: Mar chara nó ball den teaghlach beidh ort go leor tacaíochta agus cúnaimh a chur ar fáil - i gcás galair ar bith d'fhéadfadh sé go mbeadh sé píosa go mbeadh biseach ar an duine agus beidh laethanta níos fearr ná a chéile

source: The Health Service Executive (HSE) has produced a free booklet, Postnatal Depression (pdf) which may be of assistance
ga: D'fhoilsigh Feidhmeannacht na Seirbhíse Sláinte leabhrán saor in aisce dar teideal Storm iarbhreithe (pdf). Is féidir a bheith ina cúnamh

source: Any of the following organisations can offer friendship, advice and support
ga: Tá cairdeas, comhairle agus tacaíocht ar fáil ó na heagrais seo a leanas
